Rokasbarasa1/STM32-Quadcopter/src/main.c
const float gyro_correction[3] = {
    -2.410027, 3.079669, 0.590763
};


// handling loop timing ###################################################################################
uint32_t loop_start_time = 0;
uint32_t loop_end_time = 0;
int16_t delta_loop_time = 0;

// Accelerometer values to degrees conversion #############################################################
float accelerometer_x_rotation = 0;
float accelerometer_y_rotation = 0;
float magnetometer_z_rotation = 0;

// Radio config ########################################################################################### 
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
char rx_data[32];
char rx_type[32];

// PID errors ##############################################################################################
double error_pitch = 0;
double error_roll = 0;
double error_yaw = 0;
double error_altitude = 0;

// Actual PID adjustment for pitch
// const double base_pitch_master_gain = 1.0;
// const double base_pitch_gain_p = 0.0; // 0.35
// const double base_pitch_gain_i = 0.0; // 0.0
// const double base_pitch_gain_d = 0.0; // 130.0
#define BASE_PITCH_MASTER_GAIN 550
#define BASE_PITCH_GAIN_P 550
#define BASE_PITCH_GAIN_I 550
#define BASE_PITCH_GAIN_D 550

// Before idle motors
// const double gain_p = 0.41; 
// const double gain_i = 0.1;
// const double gain_d = 0.0;

// Notes for PID
// 1) It is important that the natural state without power of the drone is not stable, otherwise 
// some offset of center off mass or pid desired point needs to introduced
// 2) Remember that the drone when in the air has motors spinning at idle power, just enough 
// to float in the air. If you are testing with drone constrained add a base motor speed to account for this.


// PID for roll
const float roll_gain_p = 0.0; 
const float roll_gain_i = 0.0;
const float roll_gain_d = 0.0;

// PID for yaw
const float yaw_gain_p = 0.0; 
const float yaw_gain_i = 0.0;
const float yaw_gain_d = 0.0;

// PID for yaw
const float altitude_gain_p = 0.0; 
const float altitude_gain_i = 0.0;
const float altitude_gain_d = 0.0;

// Used for smooth changes to PID while using remote control. Do not touch this



double pitch_master_gain = BASE_PITCH_MASTER_GAIN; // Dont you just love the STM#2 compiler?
double pitch_gain_p = BASE_PITCH_GAIN_P;
double pitch_gain_i = BASE_PITCH_GAIN_I;
double pitch_gain_d = BASE_PITCH_GAIN_D;
double added_pitch_master_gain = 0;
double added_pitch_gain_p = 0;
double added_pitch_gain_i = 0;
double added_pitch_gain_d = 0;

// Refresh rate ##############################################################################################

// remember that the stm32 is not as fast as the esp32 and it cannot print lines at the same speed
// const float refresh_rate_hz = 400;
#define REFRESH_RATE_HZ 50

// Sensor stuff ##############################################################################################
float complementary_ratio = 1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ)); // Depends on how often the loop runs. 1 second / (1 second + one loop time)
float acceleration_data[] = {0,0,0};
float gyro_angular[] = {0,0,0};
float gyro_degrees[] = {0,0,0};
float magnetometer_data[] = {0,0,0};
double gps_longitude = 0.0;
double gps_latitude = 0.0;
float pressure = 0.0;
float temperature = 0.0;
float altitude = 0.0;

double target_pitch = 0.0;
double target_roll = 0.0;
double target_yaw = 0.0;
double target_altitude = 0.0;

double motor_power[] = {0.0, 0.0, 0.0, 0.0};


// Remote control settings ############################################################################################
double max_yaw_attack = 40.0;
double max_pitch_attack = 1.5;
double pitch_attack_step = 0.1;

uint8_t throttle = 0;
uint8_t yaw = 50;
uint8_t last_yaw = 50;
uint8_t pitch = 50;
uint8_t roll = 50;

uint8_t shit_encoder_mode = 1;
uint8_t slowing_lock = 0;

double last_raw_yaw = 0;
double delta_yaw = 0;

int main(void){
    init_STM32_peripherals();
    printf("STARTING PROGRAM\n"); 
    // calibrate_escs();
    init_sensors();
    init_loop_timer();
    check_calibrations();
    get_initial_position();

    // For radio
    uint8_t throttle = 0;
    uint8_t yaw = 50;
    uint8_t pitch = 50;
    uint8_t roll = 50;

    struct pid pitch_pid = pid_init(pitch_master_gain * pitch_gain_p, pitch_master_gain * pitch_gain_i, pitch_master_gain * pitch_gain_d, 0.0, HAL_GetTick(), 100.0, -100.0, 1);
    struct pid roll_pid = pid_init(pitch_master_gain * pitch_gain_p, pitch_master_gain * pitch_gain_i, pitch_master_gain * pitch_gain_d, 0.0, HAL_GetTick(), 100.0, -100.0, 1);
    struct pid yaw_pid = pid_init(yaw_gain_p, yaw_gain_i, yaw_gain_d, 0.0, HAL_GetTick(), 0, 0, 0);
    struct pid altitude_pid = pid_init(yaw_gain_p, yaw_gain_i, yaw_gain_d, 0.0, HAL_GetTick(), 0, 0, 0);

    // struct pid x_pid = pid_init(gain_p, gain_i, gain_d, 0.0, HAL_GetTick(), 180.0, -180.0, 1);
    // struct pid y_pid = pid_init(gain_p, gain_i, gain_d, 45.0, HAL_GetTick(), 180.0, -180.0, 1);
    // struct pid altitude_pid = pid_init(gain_p, gain_i, gain_d, 1.5, HAL_GetTick(), 0.0, 100.0, 1);

    while (1){
        // Read sensor data ######################################################################################################################
        gps_latitude = bn357_get_latitude_decimal_format();
        gps_longitude = bn357_get_longitude_decimal_format();
        //temperature = bmp280_get_temperature_celsius();

        // calculate the altitude using gps altitude and a bmp280 reference altitude
        // Reset the reference on bmp280 every time the gps gets updated
        // So the barometer keeps track in between the gps updates and does so with the 
        // origin of the precise altitude value from gps

        // altitude = get_sensor_fusion_altitude(bn357_get_altitude_meters() ,(double)bmp280_get_height_meters_from_reference(bn357_get_status_up_to_date(1)));


        mpu6050_get_accelerometer_readings_gravity(acceleration_data);
        mpu6050_get_gyro_readings_dps(gyro_angular);
        qmc5883l_magnetometer_readings_micro_teslas(magnetometer_data);

        // Convert the sensor data to data that is useful
        fix_mag_axis(magnetometer_data); // Switches around the x and the y of the magnetometer to match mpu6050 outputs
        calculate_degrees_x_y(acceleration_data, &accelerometer_x_rotation, &accelerometer_y_rotation); // Get roll and pitch from the data. I call it x and y. Ranges -90 to 90. 

