Rokasbarasa1/STM32-Quadcopter/src/main.c
        // My mpu6050 has a drift problem when rotating around z axis. I have only seen Joop Broking having this problem.
        // Raw yaw - yaw without tilt adjustment
        // Yaw - yaw with tilt adjustment
        // Get raw yaw. The results of this adjustment have to modify the values of gyro degrees before complementary filter. So only the non tilt adjusted yaw is available
        calculate_yaw(magnetometer_data, &magnetometer_z_rotation);

        if(yaw != 50){ // This is not an issue when not rotating.
            // Joop Brokings method did not work for me and it didn't make sense subtracting scaled total yaw. I subtract delta yaw instead
            delta_yaw = angle_difference(magnetometer_z_rotation, last_raw_yaw); // Helper function to handle wrapping

            // gyro_angular[0] -= delta_yaw * -16.5; 
            gyro_angular[0] -= delta_yaw * -5.0; 

            // This robot doesn't use the y axis so i ignore it 
        }

        // Save the raw yaw for next loop. No mater if yaw changes or not. Need to know the latest one
        last_raw_yaw = magnetometer_z_rotation;

        // Use complementary filter to correct the gyro drift. 
        convert_angular_rotation_to_degrees_x_y(gyro_angular, gyro_degrees, accelerometer_x_rotation, accelerometer_y_rotation, HAL_GetTick(), 1);

        // Get yaw that is adjusted by x and y degrees
        calculate_yaw_tilt_compensated(magnetometer_data, &magnetometer_z_rotation, gyro_degrees[0], gyro_degrees[1]);

        // Complementary filter did not work good for magnetometer+gyro. 
        // Gyro just too slow and inaccurate for this.
        // I trust the magnetometer more than the gyro in this case.
        gyro_degrees[2] = magnetometer_z_rotation;

        // Receive remote control data ###########################################################################################################
        uint8_t data_received = 0;

        if(nrf24_data_available(1)){
            
            nrf24_receive(rx_data);
            data_received = 1;
            // Get the type of request
            extract_request_type(rx_data, strlen(rx_data), rx_type);

            if(strcmp(rx_type, "joystick") == 0){


                extract_joystick_request_values(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);

                // Check if pitch is neutral
                if(pitch == 50){

                    // Had some issues with floats not being zero.
                    // If value is between pitch attack and negative pitch attack then just set it to zero
                    if(target_pitch < pitch_attack_step/2 && target_pitch > -pitch_attack_step/2){
                        target_pitch = 0.0;
                    }

                    // If value is above pitch attack values 
                    // Start slowing going back to zero
                    if(target_pitch > 0 && target_pitch != 0){
                        target_pitch = target_pitch - pitch_attack_step;
                    }else if(target_pitch < 0  && target_pitch != 0){
                        target_pitch = target_pitch + pitch_attack_step;
                    }
                }else if (pitch != 50){
                    // If pitch is not neutral start increasing into some direction.

                    if(shit_encoder_mode){
                        // Because my encoder is shit it prefers to have the extremes of pitch as 
                        // that doesn't overwhelm the pid of it.
                        if(pitch > 60){
                            target_pitch = target_pitch + pitch_attack_step;
                        }else if(pitch < 40){
                            target_pitch = target_pitch - pitch_attack_step;
                        }
                    }else{
                        target_pitch = target_pitch + map_value(pitch, 0.0, 100.0, -pitch_attack_step, pitch_attack_step);
                    }
                }

                // Make sure that the value is in the boundaries
                if(target_pitch > max_pitch_attack){
                    target_pitch = max_pitch_attack;
                }else if(target_pitch < -max_pitch_attack){
                    target_pitch = -max_pitch_attack;
                }

                // Handle the yaw value
                if(yaw != 50){
                    // There is an issue with the remote sometimes sending a 0 yaw

                    target_yaw = gyro_degrees[2] + map_value(yaw, 0.0, 100.0, -max_yaw_attack, max_yaw_attack);
                    
                    // handle the switch from -180 to 180 degrees
                    if(target_yaw > 180.0){
                        target_yaw = target_yaw - 360.0;
                    }else if(target_yaw < -180.0){
                        target_yaw = target_yaw + 360.0;
                    }
                }

                // Reset the yaw to the current degrees
                if(last_yaw != 50 && yaw == 50){
                    target_yaw = gyro_degrees[2];
                }

                last_yaw = yaw;
            }else if(strcmp(rx_type, "pid") == 0){
                double added_proportional = 0;
                double added_integral = 0;
                double added_derivative = 0;
                double added_master_gain = 0;

                extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);

                pitch_gain_p = BASE_PITCH_GAIN_P + added_proportional;
                pitch_gain_i = BASE_PITCH_GAIN_I + added_integral;
                pitch_gain_d = BASE_PITCH_GAIN_D + added_derivative;
                pitch_master_gain = BASE_PITCH_MASTER_GAIN + added_master_gain;

                added_pitch_gain_p = added_proportional;
                added_pitch_gain_i = added_integral;
                added_pitch_gain_d = added_derivative;
                added_pitch_master_gain = added_master_gain;

                pid_set_proportional_gain(&pitch_pid, pitch_gain_p * pitch_master_gain);
                pid_set_integral_gain(&pitch_pid, pitch_gain_i * pitch_master_gain);
                pid_set_derivative_gain(&pitch_pid, pitch_gain_d * pitch_master_gain);
                pid_reset_integral_sum(&pitch_pid);
            }else if(strcmp(rx_type, "remoteSyncBase") == 0){
                send_pid_base_info_to_remote();
            }else if(strcmp(rx_type, "remoteSyncAdded") == 0){
                send_pid_added_info_to_remote();
            }

            rx_type[0] = '\0'; // Clear out the string by setting its first char to string terminator
        }

        // double error_altitude = mapValue(pid_get_error(&altitude_pid, altitude, HAL_GetTick()), -180.0, 180.0, -100.0, 100.0);
        // printf("Altitude error %6.2f ", error_altitude);
        
        if(data_received){
        // if(1){

            pid_set_desired_value(&pitch_pid, target_pitch);
            pid_set_desired_value(&yaw_pid, target_roll);
            pid_set_desired_value(&yaw_pid, target_yaw);
            pid_set_desired_value(&yaw_pid, target_altitude);

            // pitch is facing to the sides
            // roll is facing forwards and backwards
            error_pitch = pid_get_error(&pitch_pid, gyro_degrees[0], HAL_GetTick());
            error_roll = pid_get_error(&roll_pid, gyro_degrees[1], HAL_GetTick());
            error_yaw = pid_get_error(&roll_pid, gyro_degrees[2], HAL_GetTick());
            error_altitude = pid_get_error(&roll_pid, altitude, HAL_GetTick());

