Rokasbarasa1/STM32-Quadcopter/src/main.c
            error_altitude = 15;
            error_pitch = 0;

            motor_power[0] = error_altitude + (-error_roll) + (-error_pitch);
            motor_power[1] = error_altitude + (-error_roll) +  (error_pitch);
            motor_power[2] = error_altitude +  (error_roll) +  (error_pitch);
            motor_power[3] = error_altitude +  (error_roll) + (-error_pitch);

            // GPS side
            TIM2->CCR1 = setServoActivationPercent(motor_power[2], min_esc_pwm_value, max_esc_pwm_value);
            TIM2->CCR2 = setServoActivationPercent(motor_power[3], min_esc_pwm_value, max_esc_pwm_value);

            // No gps side
            TIM1->CCR1 = setServoActivationPercent(motor_power[0], min_esc_pwm_value, max_esc_pwm_value);
            TIM1->CCR4 = setServoActivationPercent(motor_power[1], min_esc_pwm_value, max_esc_pwm_value);
            
            // printf(" ACTIVATION: motor0- %6.2f, motor1- %6.2f, motor2- %6.2f, motor3- %6.2f ", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
        }else{
            // GPS side
            TIM2->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, max_esc_pwm_value);
            TIM2->CCR2 = setServoActivationPercent(0, min_esc_pwm_value, max_esc_pwm_value);

            // No gps side
            TIM1->CCR1 = setServoActivationPercent(0, min_esc_pwm_value, max_esc_pwm_value);
            TIM1->CCR4 = setServoActivationPercent(0, min_esc_pwm_value, max_esc_pwm_value);
        }
        
        // Print out for debugging
        printf("ACCEL, %6.2f, %6.2f, %6.2f, ", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        // printf("GYRO, %6.2f, %6.2f, %6.2f, ", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
        // printf("AXIS, %6.2f, %6.2f, %6.2f, ", accelerometer_x_rotation, accelerometer_y_rotation, magnetometer_z_rotation);
        // printf("MAG, %6.2f, %6.2f, %6.2f, ", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // printf("NORTH, %6.2f, %6.2f, %6.2f, ", north_direction[0], north_direction[1], north_direction[2]);
        // printf("TEMP %6.5f, ", temperature);
        // printf("ALT %6.2f, ", altitude);
        // printf("GPS %f, %f, ", gps_longitude, gps_latitude);
        // printf("ERROR x=%6.2f y=%6.2f, ", error_x, error_y);
        // printf("MOTOR 1=%6.2f 2=%6.2f 3=%6.2f 4=%6.2f, ", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
        // printf("ERROR x=%6.2f y=%6.2f ", error_x, error_y);
        printf("\n");
        // printf("Loop\n");

        handle_loop_timing();
    }
}

void init_STM32_peripherals(){
    HAL_Init();
    SystemClock_Config();
    MX_GPIO_Init();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 0);

    HAL_Delay(1);
    MX_DMA_Init(); // This has to be before the uart inits, otherwise dma interrupts dont work
    MX_I2C1_Init();
    MX_SPI1_Init();
    MX_TIM1_Init();
    MX_TIM2_Init();
    HAL_Delay(1);
    MX_USART2_UART_Init();
    MX_USART1_UART_Init();
    RetargetInit(&huart1);

    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);

    // HAL_UART_RegisterCallback(&huart2, HAL_UART_ERROR_CB_ID, HAL_UART_ErrorCallback);

    HAL_UARTEx_ReceiveToIdle_DMA(&huart2, receive_buffer, GPS_RECEIVE_BUFFER_SIZE);
    __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
}

void calibrate_escs(){
    // Delay for things to settle down in the mcu init
    HAL_Delay(2000);

    // Set the max value
    uint16_t max_pwm = setServoActivationPercent(100, min_esc_pwm_value, max_esc_pwm_value);
    printf("Max: %d\n", max_pwm);
    TIM1->CCR1 = max_pwm;
    TIM1->CCR4 = max_pwm;
    TIM2->CCR1 = max_pwm;
    TIM2->CCR2 = max_pwm;
    HAL_Delay(3000);
    
    // Set the min value
    uint16_t min_pwm = setServoActivationPercent(0, min_esc_pwm_value, max_esc_pwm_value);
    printf("Min: %d\n", min_pwm);
    TIM1->CCR1 = min_pwm;
    TIM1->CCR4 = min_pwm;
    TIM2->CCR1 = min_pwm;
    TIM2->CCR2 = min_pwm;

    // 10 Seconds of min value init just to make sure
    HAL_Delay(10000);

    // After calibration remember that the 1 percent throttle might not do anything and it only starts moving at 3 percent throttle
    // This is if it is starting from 0
}

void init_sensors(){
    printf("-----------------------------INITIALIZING MODULES...\n");

    uint8_t mpu6050 = init_mpu6050(&hi2c1, 1, accelerometer_correction, gyro_correction, REFRESH_RATE_HZ, complementary_ratio);
    uint8_t qmc5883l = init_qmc5883l(&hi2c1, 1, hard_iron_correction, soft_iron_correction);

    // uint8_t bmp280 = 0;
    uint8_t bmp280 = init_bmp280(&hi2c1);
    // uint8_t bme280 = init_bme280(&hi2c1);
    // uint8_t bmp680 = init_bmp680(&hi2c1);
    // uint8_t ms5611 = init_ms5611(&hi2c1);
    // uint8_t mpl3115a2 = init_mpl3115a2(&hi2c1);


    uint8_t bn357 = init_bn357(&huart2, 0);
    uint8_t nrf24 = init_nrf24(&hspi1);

    printf("-----------------------------INITIALIZING MODULES DONE... ");

    if (mpu6050 && qmc5883l && bmp280 && bn357 && nrf24){
        printf("OK\n");
    }else{
        printf("NOT OK\n");
    }

    // Continue initializing
    nrf24_rx_mode(tx_address, 10);
}

void init_loop_timer(){
    loop_start_time = HAL_GetTick();
}

void check_calibrations(){
    // Checking errors of mpu6050
    find_accelerometer_error(1000);
    find_gyro_error(300);
}

void get_initial_position(){
    // Find the initial position in degrees and apply it to the gyro measurement integral
    // This will tell the robot which way to go to get the actual upward
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    mpu6050_get_gyro_readings_dps(gyro_angular);
    qmc5883l_magnetometer_readings_micro_teslas(magnetometer_data);
    fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050

    calculate_degrees_x_y(acceleration_data, &accelerometer_x_rotation, &accelerometer_y_rotation);

    // Get a good raw yaw for calculations later
    calculate_yaw(magnetometer_data, &magnetometer_z_rotation);
    last_raw_yaw = magnetometer_z_rotation;

    calculate_yaw_tilt_compensated(magnetometer_data, &magnetometer_z_rotation, accelerometer_x_rotation, accelerometer_y_rotation);

    gyro_degrees[0] = accelerometer_x_rotation;
    gyro_degrees[1] = accelerometer_y_rotation;
    gyro_degrees[2] = magnetometer_z_rotation;

    printf("Initial location x: %.2f y: %.2f, z: %.2f\n", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);

    // Set the desired yaw as the initial one
    target_yaw = gyro_degrees[2];
}

void handle_loop_timing(){
    loop_end_time = HAL_GetTick();
    delta_loop_time = loop_end_time - loop_start_time;
    //printf("Tim: %d ms\n", delta_loop_time);
    if (delta_loop_time < (1000 / REFRESH_RATE_HZ))
    {
        HAL_Delay((1000 / REFRESH_RATE_HZ) - delta_loop_time);
    }
    loop_start_time = HAL_GetTick();
}

